app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

/    respond_to do |format| /
      if @post.save
---
INSERT INTO "posts" ("name", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", ""], ["title", ""], ["content", ""], ["created_at", "2018-02-28 20:45:32.952297"], ["updated_at", "2018-02-28 20:45:32.952297"]]

  def update
 /   respond_to do |format|/
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "m,vflbvhjnslfnblsdnblksdn wekfjqelrkjgwlkenfglsdmfng,sdfmng,mnbkdmsnblbsdknblksdnfbldnbkladmbnskn"], ["updated_at", "2018-02-15 00:27:34.809866"], ["id", 5]]